using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HomeWork
{
    public class Cars
    {

        public void bmw()
        {
            Console.WriteLine("BMW AG — немецкий производитель автомобилей, мотоциклов, двигателей," +
                " а также велосипедов. Более 45 % акций принадлежит семье Квандт." +
                " Председателем правления компании является Оливер Ципсе. Главный дизайнер — Йозеф Кабан." +
                " В списке крупнейших публичных компаний мира Forbes Global 2000 за 2022 год BMW Group заняла 64-е место," +
                " а в списке Fortune Global 500 — 59-е место.\nДевиз компании — «Freude am Fahren»," +
                " с нем. — «С удовольствием за рулём». Для англоязычных стран был придуман также девиз «The Ultimate Driving Machine»" +
                " (с англ. — «Идеальная машина для вождения»).");
        }
        public void ford()
        {
            Console.WriteLine("Ford Motor Company, «Форд мотор компани» — американская автомобилестроительная компания." +
                " Четвёртый в мире производитель автомобилей по объёму выпуска за весь период существования." +
                " Штаб-квартира компании располагается в городе Дирборн в пригороде Детройта в штате Мичиган." +
                "В числе крупнейших компаний США по размеру выручки в 2022 году (список Fortune 500) Ford Motor заняла 22-е место," +
                " а среди крупнейших компаний мира (список Fortune Global 500) — 53-е место." +
                " В списке крупнейших публичных компаний мира Forbes Global 2000 за 2022 год Ford Motor заняла 60-е место.");
        }
        public void kia()
        {
            Console.WriteLine("Kia Corporation — южнокорейская автомобилестроительная компания," +
                " второй автопроизводитель в Республике Корея. Основана в декабре 1944 года," +
                " после банкротства в 1997 году вошла в состав Hyundai Motor Group." +
                " Продажи компании составляют около 3 млн автомобилей в год, основными рынками являются Республика Корея," +
                " США, Западная Европа, Китай и Индия. В списке крупнейших публичных компаний мира Forbes Global 2000 за 2022" +
                " год Kia заняла 283-е место.");
        }
        public void audi()
        {
            Console.WriteLine("Audi AG — немецкая автомобилестроительная компания в составе концерна Volkswagen Group," +
                " специализирующаяся на выпуске автомобилей под маркой Audi. Штаб-квартира расположена в городе Ингольштадт (Германия)." +
                " Девиз — Vorsprung durch Technik (с нем. — «Прогресс через технологии»)." +
                " Объём производства в 2016 году составил около 1 903 259 автомобилей.");
        }
        public void honda()
        {
            Console.WriteLine("Honda Motor Co., Ltd. — японская транснациональная корпорация," +
                " основанная в 1948 году изобретателем и предпринимателем Соитиро Хондой и финансистом Такэо Фудзисавой," +
                " производитель автомобилей и мотоциклов. Honda является крупнейшим производителем мотоциклов в мире с 1959 года," +
                " достигнув 400 миллионов произведённых мотоциклов к концу 2019," +
                " а также крупнейший в мире производитель двигателей внутреннего сгорания," +
                " производящий более 14 миллионов двигателей внутреннего сгорания ежегодно." +
                " В 2001 году Honda стала вторым по величине японским производителем автомобилей." +
                " В 2015 году Honda была восьмым по величине производителем автомобилей в мире.");
        }
        public void opel()
        {
            Console.WriteLine("Opel Automobile GmbH — немецкий производитель автомобилей, штаб-квартира расположена в Рюссельсхайме (Германия)." +
                " Компания была основана 21 января 1862 года; к выпуску автомобилей приступили в 1899 году." +
                " С 1929 года принадлежала концерну General Motors. С 2017 года принадлежит концерну Groupe PSA (Stellantis).");
        }

    }
}
